ymaps.ready(init);

function init() {
    var myMap = new ymaps.Map("map", {
        center: [60.027346, 30.661338],
        zoom: 10,
    }, {
        searchControlProvider: 'yandex#search'
    });

    // Создаем многоугольник, используя вспомогательный класс Polygon.
    var myPolygon = new ymaps.Polygon([
            // Указываем координаты вершин многоугольника.
            [30.6922339122011, 60.0883316600952], 
			[30.7052372615053, 60.0856305860998],
			[30.7170389811708, 60.0840226985256],
			[30.7189272563173, 60.0828435309624],
			[30.7197855632021, 60.0814713554375],
			[30.724463335724, 60.0793486585495],
			[30.7302354495241, 60.0780835517635],
			[30.7332395236208, 60.079949031171],
			[30.7373593966676, 60.0805922753801],
			[30.7425950686647, 60.0796702881036],
			[30.7392476718141, 60.0755960811653],
			[30.745899550171, 60.0726151572345],
			[30.7485603015138, 60.0738161375212],
			[30.7736228625491, 60.0714784747621],
			[30.7752965609744, 60.065773021898],
			[30.7796739260867, 60.0625444981443],
			[30.7858108203128, 60.0567731245251],
			[30.7837508837893, 60.055871926456],
			[30.7826780001834, 60.0545629995755],
			[30.778472296448, 60.0537475761741],
			[30.7786868731692, 60.0517303893415],
			[30.7716058413699, 60.0488546113008],
			[30.7690952937321, 60.0499384228373]
            
        ],
        // Описываем свойства геообъекта.
        {
            // Содержимое балуна.
            balloonContent: "Рыбные места"
        }, {
				fillColor: '#32CD32',
				// Делаем полигон прозрачным для событий карты.
				//interactivityModel: 'default#transparent',
				strokeWidth: 8,
				opacity: 0.4
			}
    );

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myPolygon);
}